from config import MORE_URL, FOR_WHAT_URL

text = {
    "choose_lang": "Выбери язык. Обери мову. Choose language",
    "ru": {
        "start_message": "<b>Привет👋 Здесь ты можешь узнать рейтинг📊 <i>ботов</i> / <i>каналов</i> / <i>групп</i> /"
                         f" <i>юзеров</i>. </b>\n❔<a href='{MORE_URL}'>Подробнее..</a>\n❔<a href='{FOR_WHAT_URL}'>Зачем мне это..</a>"
                         "\n\n<b>Способы как узнать рейтинг📊:</b>\n● Переслать сообщение📩️"
                         "\n● Отправить @username или t.me/username🔗",
        "help": "Помощь",
        "edit_lang": "Змінити мову/Change language",
        "about_us": "О нас",
        "smth_wrong": "У меня не получилось найти @username или t.me/username 😞",
        "wait": "Ожидайте...",
        "rate": "У {}:\n\n<b>{}⭐️ - средняя оценка</b>\nТвоя оценка - <b>{} </b>\nВсего <i>{}</i> оценок\n\nТы можешь изменить"
                " свою оценку, предварительно пройдя капчу",
        "rate_not_full": "У {}:\n<b>{}⭐️ - средняя оценка</b>\nВсего <i>{}</i> оценок\n\nТы можешь оценить, предварительно пройдя капчу",
        "smth_wrong_id": "У меня не получилось найти <code>chat_id</code> 😞",
        "make_captcha": "<b>Чтобы продолжить - реши капчу.</b> \nДля нас это очень важно, так как от этого зависит правдивость"
                        " рейтингов. Если не находишь ответ в списке, возможно стоит открыть картинку полностью или"
                        " поискать математические знаки😉",
        "make_captcha_again": "<b>Ничего страшного! попробуй ещё раз, у тебя много попыток</b>😉",
        "captch_done": "Готово! Сейчас внесём изменения в базу данных.",
        "share_rating": "📨Поделиться рейтингом"
    },
    "en": {
        "start_message": "<b>Hello👋 Here you can see rating📊 <i>bots</i> / <i>channels</i> / <i>groups</i> /"
                         f" <i>users</i>. </b>\n❔<a href='{MORE_URL}'>More..</a>\n❔<a href='{FOR_WHAT_URL}'>Why do I need this..</a>"
                         "\n\n<b>Ways to find out rating📊:</b>\n● Forward message📩️"
                         "\n● Send @username or t.me/username🔗",
        "help": "Help",
        "edit_lang": "Змінити мову/Изменить язык",
        "about_us": "About us",
        "smth_wrong": "I couldn't find @username or t.me/username 😞",
        "wait": "Wait...",
        "rate": "{}:\n\n<b>{}⭐️ - average rating</b>\nYour rating is <b>{} </b>\nTotal <i>{}</i> ratings\n\nYou can change"
                " your assessment, having previously passed the captcha",
        "rate_not_full": "{}:\n<b>{}⭐️ has an average rating</b>\nTotal <i>{}</i> ratings\n\nYou can rate by completing the captcha first",
        "smth_wrong_id": "I couldn't find <code>chat_id</code> 😞",
        "make_captcha": "<b>Solve the captcha to continue.</b> \nThis is very important for us, because the veracity of ratings depends on it. "
                        "If you don't find the answer in the list, maybe you should open the picture in full or "
                        "look for math signs😉",
        "make_captcha_again": "<b>It's okay! try again, you have many attempts</b>😉",
        "captch_done": "Done! Let's make changes to the database now.",
        "share_rating": "📨Share the rating"
    },
    "uk": {
        "start_message": "<b>Привіт👋 Тут ти можеш дізнатися про рейтинг📊 <i>ботів</i> / <i>каналів</i> / <i>груп</i> /"
                         f" <i>юзерів</i>. </b>\n❔<a href='{MORE_URL}'>Докладніше..</a>\n❔<a href='{FOR_WHAT_URL}'>Навіщо мені це..</a>"
                         "\n\n<b>Спосіб як дізнатися рейтинг📊:</b>\n● Переслати повідомлення📩️"
                         "\n● Надіслати @username або t.me/username🔗",
        "help": "Допомога",
        "edit_lang": "Изменить язык/Change language",
        "about_us": "Про нас",
        "smth_wrong": "У мене не вдалося знайти @username або t.me/username 😞",
        "wait": "Чекайте...",
        "rate": "У {}:\n\n<b>{}⭐️ - середня оцінка</b>\nТвоя оцінка - <b>{} </b>\nУсього <i>{}</i> оцінок\n\nТи можеш змінити"
                " свою оцінку, попередньо пройшовши капчу",
        "rate_not_full": "У {}:\n<b>{}⭐️ - середня оцінка</b>\nУсього <i>{}</i> оцінок\n\nТи можеш оцінити, попередньо пройшовши капчу",
        "smth_wrong_id": "У мене не вдалося знайти <code>chat_id</code> 😞",
        "make_captcha": "<b>Щоб продовжити - розв'яжи капчу.</b> \nДля нас це дуже важливо, тому що від цього залежить правдивість"
                        " рейтингів. Якщо не знаходиш відповідь у списку, можливо, варто відкрити картинку повністю або"
                        "пошукати математичні знаки😉",
        "make_captcha_again": "<b>Нічого страшного! спробуй ще раз, у тебе багато спроб</b>😉",
        "captch_done": "Готово! Зараз внесемо зміни до бази даних.",
        "share_rating": "📨Поділитись рейтингом"
    }
}
